app/controllers/candidates_controller.rb

  def create
    @candidate = Candidate.new(candidate_params)

    respond_to do |format|
      if @candidate.save
---
INSERT INTO "candidates" ("number", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["number", 40], ["name", "Lubo"], ["created_at", "2015-10-10 16:26:58.788562"], ["updated_at", "2015-10-10 16:26:58.788562"]]