app/controllers/voters_controller.rb

  def index
    @voters = Voter.all
---
SELECT "voters".* FROM "voters"

  def create
    @voter = Voter.new(voter_params)

    respond_to do |format|
      if @voter.save
---
INSERT INTO "voters" ("egn", "vote", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["egn", "1234567890"], ["vote", 5], ["created_at", "2015-10-10 16:22:52.379148"], ["updated_at", "2015-10-10 16:22:52.379148"]]

    def set_voter
      @voter = Voter.find(params[:id])
---
SELECT  "voters".* FROM "voters" WHERE "voters"."id" = ? LIMIT 1  [["id", 1]]